In [1]:
"helloworld"

'helloworld'

In [2]:
'helloworld'

'helloworld'

In [3]:
20+30

50


# MODULE-3
Algorithmic thinking with Python

1. Introduction to algorithmic Thinking 

2. Algorithm Efficiency and time complexity

3. Example algorithms - binary search, Euclid’s algorithm

4. Data structures - stack, heap and binary trees

5. Memory Management/Technologies

6. Best Practices – Keeping it simple, dry code, naming Conventions, Comments and docs.

7. Assessment

- Big oh complexity
steps:
1. In case of addition,
- need single term
- pick 1 term with highest value
- lower term to be neglected
2. Constants(numbers)-->[2x, 2=constannt, n=variable] to be converted to 1

In [4]:
n=int(input("no."))
sum=0
for no in range(n):
    print(no)
    sum=sum+no
print(sum)

no.1
0
0

Big oh notation -->worse case-max no.time takes to execute
1. ignore constants
2. ignore low order terms
Order:
O(1) < O(log(n)) < O(n) < O(nlon(n)) < O(n^2) < O(2^n) < O(n!)

#class-11
Binary search
- low index
- miidle index
- high index

In [5]:
def bin_search (arr, x):
    low = 0
    high = len(arr) -1
    mid = 0
    while low <=high:
        mid = (low+high) //2
        if arr[mid]<x:
            low=mid+1
        elif arr[mid]>x: 
            high=mid-1
        else:
            return mid
    return -1

In [6]:
print(bin_search([1,2,3,4,5],8))

-1

complexity of binary search:
best--> o(n) | average--> o(logn) | worst case--> o(lon.n) complexity

Euclid Algorithm:
Max number divides both given numbern(a,b| a=large no.(divident), b=small no(divisor)
1. among 2 numbers, consider the small number (b)
2. divide small number by large number(a/b)
3. Get some reminder, represented by (a=b*quotient+reminder)
4. Divide with the reminder as divisor and previous divisor as divident in the 2nd division
5. Divide untill 0 comes as reminder, whose divisor is the answer

In [7]:
divident = 78
divisor = 66
quotient = divident//divisor 
reminder = divident % divisor
divident = divisor * quotient + reminder

In [8]:
def gcd (x,y):
    while (y):
        x,y = y, (x % y)
    return x
a = int(input('a= '))
b = int(input('b= '))
print( gcd(a,b))

a= 2
b= 3
1

Class-13-rec|01-06-2023|Thursday

In [9]:
#Garbage collector
import gc

In [10]:
g_collector = gc.collect()
g_collector

159

# MODULE - 4 
Pandas
Introduction to Pandas

Series Data Structure - Querying and Indexing

DataFrame Data Structure - Querying, 

Indexing and loading

Merging data frames

Group by operation

Pivot table

Date/Time functionality

Example: Manipulating DataFrame

In [11]:
!pip install pandas
!pip install openpyxl

Requirement already satisfied: pandas in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)

^C

In [ ]:
import pandas as pd

In [ ]:
pd.__version__

WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)

Requirement already satisfied: openpyxl in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [14]:
#read the structured/tabular data
file_path = 'C:\\Users\\jayac\\Documents\\dsdata\\Bengaluru_House_Data.csv'
df = pd.read_csv(file_path)
df.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [15]:
#file_path = 'C:\\Users\\jayac\\Documents\\dsdata\\Bengaluru_House_Data.xlsx'
#df = pd.read_excel(file_path)
#df.head(10).to_string()

In [16]:
df.tail()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [17]:
file_path = 'C:\\Users\\jayac\\Documents\\dsdata\\Bengaluru_House_Data.csv'
df = pd.read_csv(file_path)
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [18]:
df.loc[1:9]

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [19]:
df.head()
df.tail()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [20]:
df[['total_sqft','location','size','balcony','price']]

      total_sqft                  location       size  balcony   price
0           1056  Electronic City Phase II      2 BHK      1.0   39.07
1           2600          Chikka Tirupathi  4 Bedroom      3.0  120.00
2           1440               Uttarahalli      3 BHK      3.0   62.00
3           1521        Lingadheeranahalli      3 BHK      1.0   95.00
4           1200                  Kothanur      2 BHK      1.0   51.00
...          ...                       ...        ...      ...     ...
13315       3453                Whitefield  5 Bedroom      0.0  231.00
13316       3600             Richards Town      4 BHK      NaN  400.00
13317       1141     Raja Rajeshwari Nagar      2 BHK      1.0   60.00
13318       4689           Padmanabhanagar      4 BHK      1.0  488.00
13319        550              Doddathoguru      1 BHK      1.0   17.00

[13320 rows x 5 columns]

In [21]:
file = '.csv'
df = pd.read_csv(file)
df
df.head()
df.tail()
df.loc[1]
df['area_type']

FileNotFoundError: [Errno 2] No such file or directory: '.csv'

In [ ]:
df.loc[40:50]

In [ ]:
df[df.columns[2:]]

In [ ]:
st1 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'Chandra' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'Chandra' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'Prabha' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'Suriya' , 'age':27 , 'incomes': 200, 'gender' : 'M' }
st6 = {'name' : 'Syamala' , 'age':51 , 'income': 100, 'gender' : 'F'}
st7= {'name' : 'Banu' , 'age':58 , 'incomes': 200, 'gender' : 'M' }
st8 = {'name' : 'Rohit' , 'age':27 , 'income': 100, 'gender' : 'M'}
st9 = {'name' : 'Sudha' , 'age':54 , 'incomes': 200, 'gender' : 'F' }
df = pd.DataFrame([st1,st2,st3,st4,st5,st6,st7,st8,st9])
df

In [ ]:
df.columns

In [ ]:
df['name'].unique()

In [ ]:
df['gender'].value_counts()

In [ ]:
df['age'].mean()

In [ ]:
df['age'].median()

In [ ]:
df['age'].std()

In [ ]:
df['age'].var()

In [ ]:
df.describe()

In [ ]:
st1 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'Chandra' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'Chandra' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'Prabha' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'Suriya' , 'age':27 , 'incomes': 200, 'gender' : 'M' }
st6 = {'name' : 'Syamala' , 'age':51 , 'income': 100, 'gender' : 'F'}
st7= {'name' : 'Banu' , 'age':58 , 'incomes': 200, 'gender' : 'M' }
st8 = {'name' : 'Rohit' , 'age':27 , 'income': 100, 'gender' : 'M'}
st9 = {'name' : 'Sudha' , 'age':54 , 'incomes': 200, 'gender' : 'F' }
st10 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
df = pd.DataFrame([st1,st2,st3,st4,st5,st6,st7,st8,st9,st10])
df

In [ ]:
df.duplicated()

In [ ]:
df.drop_duplicates()

In [ ]:
df

In [ ]:
df.drop_duplicates(subset=['incomes', 'name'],keep='last')

In [ ]:
df.drop_duplicates(subset=['incomes', 'name'],keep='first')

print are_type, describe, duplicate rows, drop duplicates, subset of columns- area_type & location

In [ ]:
file = 'C:\\Users\\jayac\\Documents\\dsdata\\Bengaluru_House_Data.csv'
df = pd.read_csv(file)
df

In [ ]:
df.head(10)

In [ ]:
df.tail(14)

In [ ]:
df['area_type']

In [ ]:
df.describe()

In [ ]:
df[~df.duplicated()]

In [ ]:
df.drop_duplicates()

In [ ]:
df.drop_duplicates(subset=['area_type', 'location'], keep='first')

In [ ]:
#df = pd.read_csv('../Bengaluru_House_Data')
#df

In [ ]:
#2 types of extensions:
# add rows in the data
#

In [ ]:
st1 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'Chandra' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'Chandra' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'Prabha' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'Suriya' , 'age':27 , 'incomes': 200, 'gender' : 'M' }
st6 = {'name' : 'Syamala' , 'age':51 , 'income': 100, 'gender' : 'F'}
st7= {'name' : 'Banu' , 'age':58 , 'incomes': 200, 'gender' : 'M' }
st8 = {'name' : 'Rohit' , 'age':27 , 'income': 100, 'gender' : 'M'}
st9 = {'name' : 'Sudha' , 'age':54 , 'incomes': 200, 'gender' : 'F' }
st10 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
df1 = pd.DataFrame([st1,st2,st3,st4,st5,st6,st7,st8,st9,st10])
df1

In [ ]:
st1 = {'name' : 'AAA' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'BBB' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'CCC' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'DDD' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'EEE' , 'age':27 , 'incomes': 200, 'gender' : 'M' }

df2 = pd.DataFrame([st1,st2,st3,st4,st5])
df2

In [ ]:
pd.concat([df1,df2])

In [ ]:
pd.concat([df1,df2],ignore_index=True)

In [ ]:
st1 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'Chandra' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'Chandra' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'Prabha' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'Suriya' , 'age':27 , 'incomes': 200, 'gender' : 'M' }
st6 = {'name' : 'Syamala' , 'age':51 , 'income': 100, 'gender' : 'F'}
st7= {'name' : 'Banu' , 'age':58 , 'incomes': 200, 'gender' : 'M' }
st8 = {'name' : 'Rohit' , 'age':27 , 'income': 100, 'gender' : 'M'}
st9 = {'name' : 'Sudha' , 'age':54 , 'incomes': 200, 'gender' : 'F' }
st10 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}

df1 = pd.DataFrame([st1,st2,st3,st4,st5,st6,st7,st8,st9,st10])
print(df1)

acc1 = {'name' : 'Jaya' , 'accno':1223 , 'add': 'del', 'Tax' : '0', 'gender' : 'F'}
acc2 = {'name' : 'Banu' , 'accno':2224 , 'add': 'ap', 'Tax' : '1' }
acc3 = {'name' : 'CCC' , 'accno':2232 , 'add': 'mp', 'Tax' : '2' }
acc4 = {'name' : 'DDD' , 'accno':2522 , 'add': 'tn', 'Tax' : '3'}
acc5 = {'name' : 'EEE' , 'accno':2753 , 'add': 'ap', 'Tax' : '4' }
df2 = pd.DataFrame([acc1,acc2,acc3,acc4,acc5])
print(df2)

In [ ]:
df1.merge(df2,how="inner")

In [ ]:
df1.merge(df2,how="inner",on='name')

In [ ]:
df1.merge(df2,how="inner",on='name')

In [ ]:
#table-students
#table-bank

#final- student|Bank

In [ ]:
df1.merge(df2,how="left") #left join

Class-14(rec)|02-Jun-23|Friday

4 types of merges:
1. Inner- common columns & rows
2. Left- Left side kept table data will be precerved, no chanage made added & mapped according with right table, 
include all columns if data not there fill as #NaN
3. Right- Right side kept table data will be precerved, no chanage made added & mapped according with left table, 
include all columns if data not there fill as #NaN
4. Outer- common columns & rows

In [26]:
import pandas as pd

In [27]:
st1 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'Chandra' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'Chandra' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'Prabha' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'Suriya' , 'age':27 , 'incomes': 200, 'gender' : 'M' }
st6 = {'name' : 'Syamala' , 'age':51 , 'income': 100, 'gender' : 'F'}
st7= {'name' : 'Banu' , 'age':58 , 'incomes': 200, 'gender' : 'M' }
st8 = {'name' : 'Rohit' , 'age':27 , 'income': 100, 'gender' : 'M'}
st9 = {'name' : 'Sudha' , 'age':54 , 'incomes': 200, 'gender' : 'F' }
st10 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}

df1 = pd.DataFrame([st1,st2,st3,st4,st5,st6,st7,st8,st9,st10])
print(df1)

acc1 = {'name' : 'Jaya' , 'accno':1223 , 'add': 'del', 'Tax' : '0', 'gender' : 'F'}
acc2 = {'name' : 'Banu' , 'accno':2224 , 'add': 'ap', 'Tax' : '1' }
acc3 = {'name' : 'CCC' , 'accno':2232 , 'add': 'mp', 'Tax' : '2' }
acc4 = {'name' : 'DDD' , 'accno':2522 , 'add': 'tn', 'Tax' : '3'}
acc5 = {'name' : 'EEE' , 'accno':2753 , 'add': 'ap', 'Tax' : '4' }
df2 = pd.DataFrame([acc1,acc2,acc3,acc4,acc5])
print(df2)

      name  age  income gender  incomes
0     Jaya   23   100.0      F      NaN
1  Chandra   24     NaN      F    200.0
2  Chandra   22     NaN      M    200.0
3   Prabha   25   100.0      F      NaN
4   Suriya   27     NaN      M    200.0
5  Syamala   51   100.0      F      NaN
6     Banu   58     NaN      M    200.0
7    Rohit   27   100.0      M      NaN
8    Sudha   54     NaN      F    200.0
9     Jaya   23   100.0      F      NaN
   name  accno  add Tax gender
0  Jaya   1223  del   0      F
1  Banu   2224   ap   1    NaN
2   CCC   2232   mp   2    NaN
3   DDD   2522   tn   3    NaN
4   EEE   2753   ap   4    NaN

In [28]:
df1.merge(df2,how='right')

   name   age  income gender  incomes  accno  add Tax
0  Jaya  23.0   100.0      F      NaN   1223  del   0
1  Jaya  23.0   100.0      F      NaN   1223  del   0
2  Banu   NaN     NaN    NaN      NaN   2224   ap   1
3   CCC   NaN     NaN    NaN      NaN   2232   mp   2
4   DDD   NaN     NaN    NaN      NaN   2522   tn   3
5   EEE   NaN     NaN    NaN      NaN   2753   ap   4

In [29]:
df1.merge(df2,how='outer')

       name   age  income gender  incomes   accno  add  Tax
0      Jaya  23.0   100.0      F      NaN  1223.0  del    0
1      Jaya  23.0   100.0      F      NaN  1223.0  del    0
2   Chandra  24.0     NaN      F    200.0     NaN  NaN  NaN
3   Chandra  22.0     NaN      M    200.0     NaN  NaN  NaN
4    Prabha  25.0   100.0      F      NaN     NaN  NaN  NaN
5    Suriya  27.0     NaN      M    200.0     NaN  NaN  NaN
6   Syamala  51.0   100.0      F      NaN     NaN  NaN  NaN
7      Banu  58.0     NaN      M    200.0     NaN  NaN  NaN
8     Rohit  27.0   100.0      M      NaN     NaN  NaN  NaN
9     Sudha  54.0     NaN      F    200.0     NaN  NaN  NaN
10     Banu   NaN     NaN    NaN      NaN  2224.0   ap    1
11      CCC   NaN     NaN    NaN      NaN  2232.0   mp    2
12      DDD   NaN     NaN    NaN      NaN  2522.0   tn    3
13      EEE   NaN     NaN    NaN      NaN  2753.0   ap    4

In [36]:
df1.merge(df2,how='outer')

       name   age  income gender  incomes   accno  add  Tax
0      Jaya  23.0   100.0      F      NaN  1223.0  del    0
1      Jaya  23.0   100.0      F      NaN  1223.0  del    0
2   Chandra  24.0     NaN      F    200.0     NaN  NaN  NaN
3   Chandra  22.0     NaN      M    200.0     NaN  NaN  NaN
4    Prabha  25.0   100.0      F      NaN     NaN  NaN  NaN
5    Suriya  27.0     NaN      M    200.0     NaN  NaN  NaN
6   Syamala  51.0   100.0      F      NaN     NaN  NaN  NaN
7      Banu  58.0     NaN      M    200.0     NaN  NaN  NaN
8     Rohit  27.0   100.0      M      NaN     NaN  NaN  NaN
9     Sudha  54.0     NaN      F    200.0     NaN  NaN  NaN
10     Banu   NaN     NaN    NaN      NaN  2224.0   ap    1
11      CCC   NaN     NaN    NaN      NaN  2232.0   mp    2
12      DDD   NaN     NaN    NaN      NaN  2522.0   tn    3
13      EEE   NaN     NaN    NaN      NaN  2753.0   ap    4

In [47]:
st1 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}
st2 = {'name' : 'Chandra' , 'age':24 , 'incomes': 200, 'gender' : 'F' }
st3 = {'name' : 'Chandra' , 'age':22 , 'incomes': 200, 'gender' : 'M' }
st4 = {'name' : 'Prabha' , 'age':25 , 'income': 100, 'gender' : 'F'}
st5 = {'name' : 'Suriya' , 'age':27 , 'incomes': 200, 'gender' : 'M' }
st6 = {'name' : 'Syamala' , 'age':51 , 'income': 100, 'gender' : 'F'}
st7= {'name' : 'Banu' , 'age':58 , 'incomes': 200, 'gender' : 'M' }
st8 = {'name' : 'Rohit' , 'age':27 , 'income': 100, 'gender' : 'M'}
st9 = {'name' : 'Sudha' , 'age':54 , 'incomes': 200, 'gender' : 'F' }
st10 = {'name' : 'Jaya' , 'age':23 , 'income': 100, 'gender' : 'F'}

df = pd.DataFrame([st1,st2,st3,st4,st5,st6,st7,st8,st9,st10])
print(df)

      name  age  income gender  incomes
0     Jaya   23   100.0      F      NaN
1  Chandra   24     NaN      F    200.0
2  Chandra   22     NaN      M    200.0
3   Prabha   25   100.0      F      NaN
4   Suriya   27     NaN      M    200.0
5  Syamala   51   100.0      F      NaN
6     Banu   58     NaN      M    200.0
7    Rohit   27   100.0      M      NaN
8    Sudha   54     NaN      F    200.0
9     Jaya   23   100.0      F      NaN

In [50]:
grouped_df = df.groupby(['gender'])

for group_name,group in grouped_df:
    print('____________________________________________________________________')
    print(group_name,group)
    print(group.describe())
    print('____________________________________________________________________')

____________________________________________________________________
F       name  age  income gender  incomes
0     Jaya   23   100.0      F      NaN
1  Chandra   24     NaN      F    200.0
3   Prabha   25   100.0      F      NaN
5  Syamala   51   100.0      F      NaN
8    Sudha   54     NaN      F    200.0
9     Jaya   23   100.0      F      NaN
             age  income  incomes
count   6.000000     4.0      2.0
mean   33.333333   100.0    200.0
std    14.895189     0.0      0.0
min    23.000000   100.0    200.0
25%    23.250000   100.0    200.0
50%    24.500000   100.0    200.0
75%    44.500000   100.0    200.0
max    54.000000   100.0    200.0
____________________________________________________________________
____________________________________________________________________
M       name  age  income gender  incomes
2  Chandra   22     NaN      M    200.0
4   Suriya   27     NaN      M    200.0
6     Banu   58     NaN      M    200.0
7    Rohit   27   100.0      M      NaN
             age  income  incomes
count   4.000000     1.0      3.0
mean   33.500000   100.0    200.0
std    16.502525     NaN      0.0
min    22.000000   100.0    200.0
25%    25.750000   100.0    200.0
50%    27.000000   100.0    200.0
75%    34.750000   100.0    200.0
max    58.000000   100.0    200.0
____________________________________________________________________

C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\258581691.py:3: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for group_name,group in grouped_df:

In [51]:
!pip install seaborn

Requirement already satisfied: seaborn in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (0.12.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from seaborn) (3.7.0)
Requirement already satisfied: pandas>=0.25 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from seaborn) (1.5.3)
Requirement already satisfied: numpy!=1.24.0,>=1.17 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from seaborn) (1.23.5)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: packaging>=20.0 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (22.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: pytz>=2020.1 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from pandas>=0.25->seaborn) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\jayac\appdata\local\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)

WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -cipy (c:\users\jayac\appdata\local\anaconda3\lib\site-packages)

In [70]:
import seaborn as sns

In [96]:
import seaborn as sns
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [55]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [60]:
grouped_df = df.groupby(['day'])

for group_total_bill,tip in grouped_df:
    print('____________________________________________________________________')
    print(group_total_bill,tip)
    print(group.describe())
    print('____________________________________________________________________')

____________________________________________________________________
Thur      total_bill   tip     sex smoker   day    time  size
77        27.20  4.00    Male     No  Thur   Lunch     4
78        22.76  3.00    Male     No  Thur   Lunch     2
79        17.29  2.71    Male     No  Thur   Lunch     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
81        16.66  3.40    Male     No  Thur   Lunch     2
..          ...   ...     ...    ...   ...     ...   ...
202       13.00  2.00  Female    Yes  Thur   Lunch     2
203       16.40  2.50  Female    Yes  Thur   Lunch     2
204       20.53  4.00    Male    Yes  Thur   Lunch     4
205       16.47  3.23  Female    Yes  Thur   Lunch     3
243       18.78  3.00  Female     No  Thur  Dinner     2

[62 rows x 7 columns]
       total_bill        tip       size
count   76.000000  76.000000  76.000000
mean    21.410000   3.255132   2.842105
std      8.832122   1.234880   1.007341
min      7.250000   1.010000   2.000000
25%     14.987500   2.037500   2.000000
50%     19.630000   3.150000   2.000000
75%     25.597500   4.000000   4.000000
max     48.170000   6.500000   6.000000
____________________________________________________________________
____________________________________________________________________
Fri      total_bill   tip     sex smoker  day    time  size
90        28.97  3.00    Male    Yes  Fri  Dinner     2
91        22.49  3.50    Male     No  Fri  Dinner     2
92         5.75  1.00  Female    Yes  Fri  Dinner     2
93        16.32  4.30  Female    Yes  Fri  Dinner     2
94        22.75  3.25  Female     No  Fri  Dinner     2
95        40.17  4.73    Male    Yes  Fri  Dinner     4
96        27.28  4.00    Male    Yes  Fri  Dinner     2
97        12.03  1.50    Male    Yes  Fri  Dinner     2
98        21.01  3.00    Male    Yes  Fri  Dinner     2
99        12.46  1.50    Male     No  Fri  Dinner     2
100       11.35  2.50  Female    Yes  Fri  Dinner     2
101       15.38  3.00  Female    Yes  Fri  Dinner     2
220       12.16  2.20    Male    Yes  Fri   Lunch     2
221       13.42  3.48  Female    Yes  Fri   Lunch     2
222        8.58  1.92    Male    Yes  Fri   Lunch     1
223       15.98  3.00  Female     No  Fri   Lunch     3
224       13.42  1.58    Male    Yes  Fri   Lunch     2
225       16.27  2.50  Female    Yes  Fri   Lunch     2
226       10.09  2.00  Female    Yes  Fri   Lunch     2
       total_bill        tip       size
count   76.000000  76.000000  76.000000
mean    21.410000   3.255132   2.842105
std      8.832122   1.234880   1.007341
min      7.250000   1.010000   2.000000
25%     14.987500   2.037500   2.000000
50%     19.630000   3.150000   2.000000
75%     25.597500   4.000000   4.000000
max     48.170000   6.500000   6.000000
____________________________________________________________________
____________________________________________________________________
Sat      total_bill   tip     sex smoker  day    time  size
19        20.65  3.35    Male     No  Sat  Dinner     3
20        17.92  4.08    Male     No  Sat  Dinner     2
21        20.29  2.75  Female     No  Sat  Dinner     2
22        15.77  2.23  Female     No  Sat  Dinner     2
23        39.42  7.58    Male     No  Sat  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[87 rows x 7 columns]
       total_bill        tip       size
count   76.000000  76.000000  76.000000
mean    21.410000   3.255132   2.842105
std      8.832122   1.234880   1.007341
min      7.250000   1.010000   2.000000
25%     14.987500   2.037500   2.000000
50%     19.630000   3.150000   2.000000
75%     25.597500   4.000000   4.000000
max     48.170000   6.500000   6.000000
____________________________________________________________________
____________________________________________________________________
Sun      total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3
187       30.46  2.00    Male    Yes  Sun  Dinner     5
188       18.15  3.50  Female    Yes  Sun  Dinner     3
189       23.10  4.00    Male    Yes  Sun  Dinner     3
190       15.69  1.50    Male    Yes  Sun  Dinner     2

[76 rows x 7 columns]
       total_bill        tip       size
count   76.000000  76.000000  76.000000
mean    21.410000   3.255132   2.842105
std      8.832122   1.234880   1.007341
min      7.250000   1.010000   2.000000
25%     14.987500   2.037500   2.000000
50%     19.630000   3.150000   2.000000
75%     25.597500   4.000000   4.000000
max     48.170000   6.500000   6.000000
____________________________________________________________________

C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\204364864.py:3: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for group_total_bill,tip in grouped_df:

In [72]:
tips= tips.groupby(['day'])

for total_bill,tip in tips:
    print('____________________________________________________________________')
    print(total_bill,tip)
    print(tip.mean())
    print('____________________________________________________________________')

____________________________________________________________________
Thur      total_bill   tip     sex smoker   day    time  size
77        27.20  4.00    Male     No  Thur   Lunch     4
78        22.76  3.00    Male     No  Thur   Lunch     2
79        17.29  2.71    Male     No  Thur   Lunch     2
80        19.44  3.00    Male    Yes  Thur   Lunch     2
81        16.66  3.40    Male     No  Thur   Lunch     2
..          ...   ...     ...    ...   ...     ...   ...
202       13.00  2.00  Female    Yes  Thur   Lunch     2
203       16.40  2.50  Female    Yes  Thur   Lunch     2
204       20.53  4.00    Male    Yes  Thur   Lunch     4
205       16.47  3.23  Female    Yes  Thur   Lunch     3
243       18.78  3.00  Female     No  Thur  Dinner     2

[62 rows x 7 columns]
total_bill    17.682742
tip            2.771452
size           2.451613
dtype: float64
____________________________________________________________________
____________________________________________________________________
Fri      total_bill   tip     sex smoker  day    time  size
90        28.97  3.00    Male    Yes  Fri  Dinner     2
91        22.49  3.50    Male     No  Fri  Dinner     2
92         5.75  1.00  Female    Yes  Fri  Dinner     2
93        16.32  4.30  Female    Yes  Fri  Dinner     2
94        22.75  3.25  Female     No  Fri  Dinner     2
95        40.17  4.73    Male    Yes  Fri  Dinner     4
96        27.28  4.00    Male    Yes  Fri  Dinner     2
97        12.03  1.50    Male    Yes  Fri  Dinner     2
98        21.01  3.00    Male    Yes  Fri  Dinner     2
99        12.46  1.50    Male     No  Fri  Dinner     2
100       11.35  2.50  Female    Yes  Fri  Dinner     2
101       15.38  3.00  Female    Yes  Fri  Dinner     2
220       12.16  2.20    Male    Yes  Fri   Lunch     2
221       13.42  3.48  Female    Yes  Fri   Lunch     2
222        8.58  1.92    Male    Yes  Fri   Lunch     1
223       15.98  3.00  Female     No  Fri   Lunch     3
224       13.42  1.58    Male    Yes  Fri   Lunch     2
225       16.27  2.50  Female    Yes  Fri   Lunch     2
226       10.09  2.00  Female    Yes  Fri   Lunch     2
total_bill    17.151579
tip            2.734737
size           2.105263
dtype: float64
____________________________________________________________________
____________________________________________________________________
Sat      total_bill   tip     sex smoker  day    time  size
19        20.65  3.35    Male     No  Sat  Dinner     3
20        17.92  4.08    Male     No  Sat  Dinner     2
21        20.29  2.75  Female     No  Sat  Dinner     2
22        15.77  2.23  Female     No  Sat  Dinner     2
23        39.42  7.58    Male     No  Sat  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[87 rows x 7 columns]
total_bill    20.441379
tip            2.993103
size           2.517241
dtype: float64
____________________________________________________________________
____________________________________________________________________
Sun      total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3
187       30.46  2.00    Male    Yes  Sun  Dinner     5
188       18.15  3.50  Female    Yes  Sun  Dinner     3
189       23.10  4.00    Male    Yes  Sun  Dinner     3
190       15.69  1.50    Male    Yes  Sun  Dinner     2

[76 rows x 7 columns]
total_bill    21.410000
tip            3.255132
size           2.842105
dtype: float64
____________________________________________________________________

C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\1704188678.py:3: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for total_bill,tip in tips:
C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\1704188678.py:6: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(tip.mean())
C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\1704188678.py:6: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(tip.mean())
C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\1704188678.py:6: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(tip.mean())
C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\1704188678.py:6: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(tip.mean())

In [71]:
grouped_data = tips.groupby(['time'])
for name,data in grouped_data:
    print(name,data)
    print(data.describe())

Lunch      total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3
187       30.46  2.00    Male    Yes  Sun  Dinner     5
188       18.15  3.50  Female    Yes  Sun  Dinner     3
189       23.10  4.00    Male    Yes  Sun  Dinner     3
190       15.69  1.50    Male    Yes  Sun  Dinner     2

[76 rows x 7 columns]
       total_bill        tip       size
count   76.000000  76.000000  76.000000
mean    21.410000   3.255132   2.842105
std      8.832122   1.234880   1.007341
min      7.250000   1.010000   2.000000
25%     14.987500   2.037500   2.000000
50%     19.630000   3.150000   2.000000
75%     25.597500   4.000000   4.000000
max     48.170000   6.500000   6.000000
Dinner      total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3
187       30.46  2.00    Male    Yes  Sun  Dinner     5
188       18.15  3.50  Female    Yes  Sun  Dinner     3
189       23.10  4.00    Male    Yes  Sun  Dinner     3
190       15.69  1.50    Male    Yes  Sun  Dinner     2

[76 rows x 7 columns]
       total_bill        tip       size
count   76.000000  76.000000  76.000000
mean    21.410000   3.255132   2.842105
std      8.832122   1.234880   1.007341
min      7.250000   1.010000   2.000000
25%     14.987500   2.037500   2.000000
50%     19.630000   3.150000   2.000000
75%     25.597500   4.000000   4.000000
max     48.170000   6.500000   6.000000

C:\Users\jayac\AppData\Local\Temp\ipykernel_8608\243733002.py:2: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for name,data in grouped_data:

In [78]:
tips[tips['tip'] >= 3]

     total_bill   tip     sex smoker   day    time  size
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
7         26.88  3.12    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
232       11.61  3.39    Male     No   Sat  Dinner     2
234       15.53  3.00    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
243       18.78  3.00  Female     No  Thur  Dinner     2

[121 rows x 7 columns]

In [80]:
tips[tips['size'] >= 2].describe()

       total_bill         tip        size
count  240.000000  240.000000  240.000000
mean    19.995000    3.024292    2.595833
std      8.819774    1.379067    0.936913
min      5.750000    1.000000    2.000000
25%     13.420000    2.000000    2.000000
50%     17.855000    3.000000    2.000000
75%     24.332500    3.602500    3.000000
max     50.810000   10.000000    6.000000

In [82]:
tips[tips['size'] ==2].describe()
tips[tips['size'] <= 2].describe()
tips[tips['size'] >= 2].describe()
tips[tips['size'] != 2].describe()

       total_bill        tip       size
count   88.000000  88.000000  88.000000
mean    25.703182   3.735682   3.579545
std     10.044446   1.660322   0.955584
min      3.070000   1.000000   1.000000
25%     18.335000   2.500000   3.000000
50%     24.535000   3.500000   4.000000
75%     30.662500   4.797500   4.000000
max     50.810000  10.000000   6.000000

In [102]:
tips[tips['day'] == 'Tue']

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

In [101]:
tips[(tips['day']== 'Sun') | (tips['time']=='Lunch')]

     total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
222        8.58  1.92    Male    Yes  Fri   Lunch     1
223       15.98  3.00  Female     No  Fri   Lunch     3
224       13.42  1.58    Male    Yes  Fri   Lunch     2
225       16.27  2.50  Female    Yes  Fri   Lunch     2
226       10.09  2.00  Female    Yes  Fri   Lunch     2

[144 rows x 7 columns]

In [103]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [105]:
tips[(tips['day'] == 'Sat') & (tips['time']== 'Dinner')]

     total_bill   tip     sex smoker  day    time  size
19        20.65  3.35    Male     No  Sat  Dinner     3
20        17.92  4.08    Male     No  Sat  Dinner     2
21        20.29  2.75  Female     No  Sat  Dinner     2
22        15.77  2.23  Female     No  Sat  Dinner     2
23        39.42  7.58    Male     No  Sat  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[87 rows x 7 columns]

In [111]:
import seaborn as sns
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [113]:
tips[(tips['day']=='Fri') & (tips['time']=='Lunch')]

     total_bill   tip     sex smoker  day   time  size
220       12.16  2.20    Male    Yes  Fri  Lunch     2
221       13.42  3.48  Female    Yes  Fri  Lunch     2
222        8.58  1.92    Male    Yes  Fri  Lunch     1
223       15.98  3.00  Female     No  Fri  Lunch     3
224       13.42  1.58    Male    Yes  Fri  Lunch     2
225       16.27  2.50  Female    Yes  Fri  Lunch     2
226       10.09  2.00  Female    Yes  Fri  Lunch     2

In [116]:
pd.date_range('2023-01-01', periods=3, freq='D')

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03'], dtype='datetime64[ns]', freq='D')

In [125]:
pd.date_range('2022-01-01', periods = 30, freq='10H')

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-01 10:00:00',
               '2022-01-01 20:00:00', '2022-01-02 06:00:00',
               '2022-01-02 16:00:00', '2022-01-03 02:00:00',
               '2022-01-03 12:00:00', '2022-01-03 22:00:00',
               '2022-01-04 08:00:00', '2022-01-04 18:00:00',
               '2022-01-05 04:00:00', '2022-01-05 14:00:00',
               '2022-01-06 00:00:00', '2022-01-06 10:00:00',
               '2022-01-06 20:00:00', '2022-01-07 06:00:00',
               '2022-01-07 16:00:00', '2022-01-08 02:00:00',
               '2022-01-08 12:00:00', '2022-01-08 22:00:00',
               '2022-01-09 08:00:00', '2022-01-09 18:00:00',
               '2022-01-10 04:00:00', '2022-01-10 14:00:00',
               '2022-01-11 00:00:00', '2022-01-11 10:00:00',
               '2022-01-11 20:00:00', '2022-01-12 06:00:00',
               '2022-01-12 16:00:00', '2022-01-13 02:00:00'],
              dtype='datetime64[ns]', freq='10H')

In [209]:
pd.date_range('2021-01-22', '2023-01-06', freq='w-tue')

DatetimeIndex(['2021-01-26', '2021-02-02', '2021-02-09', '2021-02-16',
               '2021-02-23', '2021-03-02', '2021-03-09', '2021-03-16',
               '2021-03-23', '2021-03-30',
               ...
               '2022-11-01', '2022-11-08', '2022-11-15', '2022-11-22',
               '2022-11-29', '2022-12-06', '2022-12-13', '2022-12-20',
               '2022-12-27', '2023-01-03'],
              dtype='datetime64[ns]', length=102, freq='W-TUE')

In [191]:
date_range=pd.date_range('2023-06-01','2024-01-21' ,freq='M')

In [180]:
date_range[0]

Timestamp('2023-06-01 00:00:00', freq='4H')

In [181]:
date_range[0].weekday()

3

In [182]:
date_range[0].month_name()

'June'

In [183]:
date_range[0].day_name()

'Thursday'

In [184]:
date_range[0].month_name()

'June'

In [4]:
numbers = input()
numberz = ' '.join(numbers)
print('\n',numberz)

3.4 2.3

 3 . 4   2 . 3

In [5]:
numbers = input()
print('\n',numberz)

2.3 4.4 5.5

 3 . 4   2 . 3

In [6]:
data =float(input())
print(data,sep='\n')

data1 =float(input())
print(data1,sep='\n')

data2 =float(input())
print(data2,sep='\n')

2.3
2.3
3.3
3.3
4.4
4.4

In [13]:
data =float(input())
print(data,'\n')
print(data1,'\n')
print(data2,'\n')

#data1 =float(input())
#print(data1,sep='\n')

#data2 =float(input())
#print(data2,sep='\n')

2.3

ValueError: could not convert string to float: ''

In [14]:
line = input()
f_line = line.split()
for value in f_line:
    print(value)

2.3 3.4 4.5
2.3
3.4
4.5

In [16]:
characters = input()
for charcter in characters:
    print(charcter)

guvigeeks
g
u
v
i
g
e
e
k
s

In [21]:
strings = input()
print(strings.split(','))

jaya,chandra,pranja
['jaya', 'chandra', 'pranja']

In [23]:
strings = input()
print(','.join(strings))

jaya
j,a,y,a

In [44]:
arr = [1,2,3,4,5]
soa = len(arr)
loa = arr[2:3]
loai=int(loa)
print(soa)
print(loa)

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'list'

In [42]:
arr = [1,2,3,4,5]
print(len(arr))
print(arr[2:3])

5
[3]

In [60]:
size, k = map(int, input().split( ))
array = list(map(int, input().split( )))
print (size, k)
print(' '.join(map(str, array)))

5 3
1 2 3 4 5
5 3
1 2 3 4 5

In [63]:
nos = (input())
print(''.join(nos))

nos2 = (input())
print(''.join(nos2))

nos3 = (input())
print(''.join(nos3))

2 3
2 3
34
34
4 5
4 5

nos3 = (input())
print(' '.join(nos3))

In [64]:
nos3 = (input())
print(' '.join(nos3))

22
2 2

In [67]:
nos3 = int(input())
print(' '.join(nos3))

3 4

ValueError: invalid literal for int() with base 10: '3 4'

In [71]:
nos3 = (input())
for no in nos3:
    print(no, end=' ')

23
2 3

In [75]:
nos = int(input())
for no in nos:
    print(no, end=' ')

3676

TypeError: 'int' object is not iterable

In [76]:
b= int(input())
d=list(str(b))
print(' '.join(d))

23436
2 3 4 3 6

In [96]:
a, b = map(int, input().split())
if a>b:
    smaller = b
else:
    smaller = a
hcf = 1
for i in range(1, smaller+1):
    if a%i==0 and b%i==0:
        hcf=i
print(hcf)

24 36
12

In [101]:
a, b = map(int, input().split())
if a>b:
    smaller = a
else:
    smaller = b
hcf = 1
for i in range(1, smaller+1):
    if a%i==0 and b%i==0:
        hcf=i
print(hcf)

2 3
1

In [103]:
a, b = map(int,input().split())
sum_res = 0
carry = 0
while(a!=0 or b!=0):
    digit_sum = (a%10+b%10) %10
    sum_res = sum_res+(digit_sum*(10**carry))
    carry +=1
    a=a//10
    b=b//10
    
print(sum_res)1

123 456
579

######

In [105]:
a,b = map(int, input().split())
sum_res = 0
carry = 0

while a!=0 or b!=0:
    digit_sum = (a%10+b%10)%10
    sum_res=sum_res+(digit_sum*(10**carry))
    carry+=1
    a=a//10
    b=b//10
print(sum_res)

44 66
0

In [112]:
a,b = map(int, input().split())
c,d = map(str, )
for b in a:
    print(d)

2 3

TypeError: decoding str is not supported

In [114]:
a,b = map(int, input().split())
for c in range(b):
    print(a)

2 3
2
2
2

In [115]:
n = int(input())
powerOfTwo=1
while powerOfTwo<=n:
    powerOfTwo*=2
print(powerOfTwo)

12
16

In [126]:
n= int(input())
sum_no=0
for i in range(1,n+1):
    sum_no+=i
print(sum_no)

10
55

In [127]:
n = int(input())
if n%2==0:
    print(' '.join(n))
else:
    print(' '.join(n))

123456

TypeError: can only join an iterable

In [130]:
n = int(input())
if n%2==0:
    print(n, sep=' ')
else:
    print(n, sep='v')

1 2 3 4 5

ValueError: invalid literal for int() with base 10: '1 2 3 4 5'

In [132]:
n = int(input())
n_str = str(n)
odd = []
even = []

for digit in n_str:
    if int(digit) %2 ==0:
        even.append(digit)
    else:
        odd.append(digit)

print(' '.join(even))
print(' '.join(odd))

123456
2 4 6
1 3 5

In [137]:
n = int(input())
n_str = str(n)
odd = []
even = []

for digit in n_str:
    digit_int=int(digit)
    if digit_int %2 ==0:
        even.append(str(digit_int))
    else:
        odd.append(str(digit_int))

print(' '.join(sorted(even)))
print(' '.join(sorted(odd)))

1234567645312
2 2 4 4 6 6
1 1 3 3 5 5 7

In [139]:
n=int(input())
o=str(n)
odd = []
even = []
for i in o:
    p=int(i)
    if p%2==0:
        even.append(str(p))
    else:
        odd.append(str(p))
print(' '.join(sorted(even)))
print(' '.join(sorted(odd)))

646537452
2 4 4 6 6
3 5 5 7

In [145]:
i= int(input())
j=1
while j<5:
    print(i)
    j+=1

3
3
3
3
3

In [148]:
i = int(input())
for j in range(5):
    print(i)

5
5
5
5
5
5

In [151]:
n = int(input())
for i in range(n, 0, -1):
    print(i)

100
100
99
98
97
96
95
94
93
92
91
90
89
88
87
86
85
84
83
82
81
80
79
78
77
76
75
74
73
72
71
70
69
68
67
66
65
64
63
62
61
60
59
58
57
56
55
54
53
52
51
50
49
48
47
46
45
44
43
42
41
40
39
38
37
36
35
34
33
32
31
30
29
28
27
26
25
24
23
22
21
20
19
18
17
16
15
14
13
12
11
10
9
8
7
6
5
4
3
2
1

In [152]:
i = input()
rev_str =''
for j in range(len(i)-1,-1,-1):
    rev_str +=i[j] 
print(rev_str)

jaya
ayaj

In [153]:
i = input()
rev_str = ''
for j in range(len(i)-1,-1,-1):
    rev_str+=i[j]
print(rev_str)

jaya
ayaj

In [154]:
i = input()
for j in i:
    rev_str = i[::-1]
print(rev_str)

jaya
ayaj